app/Models/ModelMahasiswa.php

    public function jumlahWisudawan()
    {
        return $this->db->table('tbl_mahasiswa')
            ->where('status_dokumen', 1)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_mahasiswa`
WHERE `status_dokumen` = 1

    public function jumlahMahasiswa()
    {
        return $this->db->table('tbl_mahasiswa')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_mahasiswa`