app/Models/ModelDosen.php

    public function allData()
    {
        return $this->db->table('tbl_dosen')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_dosen`