app/Models/ModelDashboardStaf.php

    public function dataPendaftaranMasuk()
    {
        return $this->db->table('tbl_mahasiswa')
            ->join('tbl_prodi', 'tbl_prodi.id_prodi=tbl_mahasiswa.id_prodi', 'LEFT')
            ->where('status_pendaftaran', 1)
            ->where('status_dokumen', 0)
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_mahasiswa`
LEFT JOIN `tbl_prodi` ON `tbl_prodi`.`id_prodi`=`tbl_mahasiswa`.`id_prodi`
WHERE `status_pendaftaran` = 1
AND `status_dokumen` = 0

    public function cekPendaftaranMasuk($npm)
    {
        return $this->db->table('tbl_mahasiswa')
            ->join('tbl_prodi', 'tbl_prodi.id_prodi=tbl_mahasiswa.id_prodi', 'LEFT')
            ->where('npm', $npm)
            ->get()->getRowArray();
---
SELECT *
FROM `tbl_mahasiswa`
LEFT JOIN `tbl_prodi` ON `tbl_prodi`.`id_prodi`=`tbl_mahasiswa`.`id_prodi`
WHERE `npm` = '1402019016'

    public function allDokumen($npm)
    {
        return $this->db->table('tbl_dokumen')
            ->join('tbl_persyaratan', 'tbl_persyaratan.id_persyaratan=tbl_dokumen.id_persyaratan', 'LEFT')
            ->where('tbl_dokumen.npm', $npm)
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_dokumen`
LEFT JOIN `tbl_persyaratan` ON `tbl_persyaratan`.`id_persyaratan`=`tbl_dokumen`.`id_persyaratan`
WHERE `tbl_dokumen`.`npm` = '1402019016'

    public function jumlahPendaftaranMasuk()
    {
        return $this->db->table('tbl_mahasiswa')
            ->where('status_pendaftaran', 1)
            ->where('status_dokumen', 0)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_mahasiswa`
WHERE `status_pendaftaran` = 1
AND `status_dokumen` = 0

    public function dataCalonWisudawan()
    {
        return $this->db->table('tbl_mahasiswa')
            ->join('tbl_prodi', 'tbl_prodi.id_prodi=tbl_mahasiswa.id_prodi', 'LEFT')
            ->where('status_pendaftaran', 2)
            ->where('status_dokumen', 2)
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_mahasiswa`
LEFT JOIN `tbl_prodi` ON `tbl_prodi`.`id_prodi`=`tbl_mahasiswa`.`id_prodi`
WHERE `status_pendaftaran` = 2
AND `status_dokumen` = 2