app/Models/ModelBeritaAcara.php

SELECT *
FROM `tbl_mahasiswa`
LEFT JOIN `tbl_prodi` ON `tbl_prodi`.`id_prodi`=`tbl_mahasiswa`.`id_prodi`
---
    public function allDataMahasiswa()
    {
        return $this->db->table('tbl_mahasiswa')
            ->join('tbl_prodi', 'tbl_prodi.id_prodi=tbl_mahasiswa.id_prodi', 'LEFT')
            ->get()->getResultArray();

SELECT *
FROM `tbl_mahasiswa`
LEFT JOIN `tbl_prodi` ON `tbl_prodi`.`id_prodi`=`tbl_mahasiswa`.`id_prodi`
WHERE `id_mahasiswa` = '2'
---
    public function detailDataMahasiswa($id_mahasiswa)
    {
        return $this->db->table('tbl_mahasiswa')
            ->join('tbl_prodi', 'tbl_prodi.id_prodi=tbl_mahasiswa.id_prodi', 'LEFT')
            ->where('id_mahasiswa', $id_mahasiswa)
            ->get()->getRowArray();