app/Models/ModelDashboardDosen.php

SELECT *
FROM `tbl_mahasiswa`
LEFT JOIN `tbl_prodi` ON `tbl_prodi`.`id_prodi`=`tbl_mahasiswa`.`id_prodi`
WHERE `pembimbing_ilmu` = 'Dosen A'
---
    public function dataMahasiswaBimbinganIlmu()
    {
        return $this->db->table('tbl_mahasiswa')
            ->join('tbl_prodi', 'tbl_prodi.id_prodi=tbl_mahasiswa.id_prodi', 'LEFT')
            ->where('pembimbing_ilmu', session()->get('nama_dosen'))
            ->get()->getResultArray();

SELECT *
FROM `tbl_mahasiswa`
LEFT JOIN `tbl_prodi` ON `tbl_prodi`.`id_prodi`=`tbl_mahasiswa`.`id_prodi`
WHERE `pembimbing_agama` = 'Dosen A'
---
    public function dataMahasiswaBimbinganAgama()
    {
        return $this->db->table('tbl_mahasiswa')
            ->join('tbl_prodi', 'tbl_prodi.id_prodi=tbl_mahasiswa.id_prodi', 'LEFT')
            ->where('pembimbing_agama', session()->get('nama_dosen'))
            ->get()->getResultArray();

SELECT *
FROM `tbl_mahasiswa`
LEFT JOIN `tbl_prodi` ON `tbl_prodi`.`id_prodi`=`tbl_mahasiswa`.`id_prodi`
WHERE `pembimbing_ilmu` = 'Dosen A'
OR `pembimbing_agama` = 'Dosen A'
---
    public function dataSuratUndangan()
    {
        return $this->db->table('tbl_mahasiswa')
            ->join('tbl_prodi', 'tbl_prodi.id_prodi=tbl_mahasiswa.id_prodi', 'LEFT')
            ->where('pembimbing_ilmu', session()->get('nama_dosen'))
            ->orWhere('pembimbing_agama', session()->get('nama_dosen'))
            ->get()->getResultArray();

SELECT *
FROM `tbl_mahasiswa`
LEFT JOIN `tbl_prodi` ON `tbl_prodi`.`id_prodi`=`tbl_mahasiswa`.`id_prodi`
WHERE `pembimbing_ilmu` = 'Dosen A'
OR `pembimbing_agama` = 'Dosen A'
---
    public function dataBeritaAcara()
    {
        return $this->db->table('tbl_mahasiswa')
            ->join('tbl_prodi', 'tbl_prodi.id_prodi=tbl_mahasiswa.id_prodi', 'LEFT')
            ->where('pembimbing_ilmu', session()->get('nama_dosen'))
            ->orWhere('pembimbing_agama', session()->get('nama_dosen'))
            ->get()->getResultArray();