app/Views/v_template_staf.php

SELECT *
FROM `tbl_mahasiswa`
LEFT JOIN `tbl_prodi` ON `tbl_prodi`.`id_prodi`=`tbl_mahasiswa`.`id_prodi`
WHERE `status_pendaftaran` = 1
AND `status_dokumen` = 0
ORDER BY `id_mahasiswa` ASC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `tbl_mahasiswa`
WHERE `status_pendaftaran` = 1
AND `status_dokumen` = 0
---

    <?php
    $db = \Config\Database::connect();
    $mhs = $db->table('tbl_mahasiswa')
        ->join('tbl_prodi', 'tbl_prodi.id_prodi=tbl_mahasiswa.id_prodi', 'LEFT')
        ->where('status_pendaftaran', 1)
        ->where('status_dokumen', 0)
        ->limit(5)
        ->orderBy('id_mahasiswa', 'ASC')
        ->get()->getResultArray();

    $jml = $db->table('tbl_mahasiswa')
        ->where('status_pendaftaran', 1)
        ->where('status_dokumen', 0)
        ->countAllResults();